---
type: EdgeArray
namespace: Autodesk.Revit.DB
version: 2024
members: 10
tags: [revit-api, class]
---

# EdgeArray

`Autodesk.Revit.DB.EdgeArray` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | EdgeArray | — | `public EdgeArray ()` |
| Method | Append | — | `public virtual void Append ( Edge item )` |
| Method | Clear | — | `public virtual void Clear ()` |
| Method | ForwardIterator | — | `public virtual EdgeArrayIterator ForwardIterator ()` |
| Method | GetEnumerator | — | `public virtual IEnumerator GetEnumerator ()` |
| Method | Insert | — | `public virtual void Insert ( Edge item , int index )` |
| Method | ReverseIterator | — | `public virtual EdgeArrayIterator ReverseIterator ()` |
| Property | IsEmpty | — | `public virtual bool IsEmpty { get ; }` |
| Property | Item | — | `public virtual Edge this [ int index ] { get ; set ; }` |
| Property | Size | — | `public virtual int Size { get ; }` |